---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsOverlapInHeight
source: html/866da556-7bec-09c1-c9b4-0db07c50113d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsOverlapInHeight Property

[Room] volumes overlap. Adjust the Upper Limit and Limit Offset properties of the [rooms].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomsOverlapInHeight { get; }
```